## <font color = 'blue' > Pandas for Data Analysis </font>

In [1]:
import pandas as pd

### Reading CSV Files

In [2]:
data_csv = pd.read_csv(r"C:\Users\prajw\Downloads\Python Files\Jupyter File\countries of the world.csv")
data_csv.head()

           Country                               Region
0     Afghanistan         ASIA (EX. NEAR EAST)
1         Albania   EASTERN EUROPE
2         Algeria   NORTHERN AFRICA
3  American Samoa   OCEANIA
4         Andorra   WESTERN EUROPE

### Reading Excel Files

In [3]:
data_xlsx = pd.read_excel(r"C:\Users\prajw\Downloads\Python Files\Jupyter File\world_population_excel_workbook.xlsx", sheet_name = 'Sheet1')
data_xlsx.head()

   Rank CCA3         Country           Capital
0    36  AFG     Afghanistan             Kabul
1   138  ALB         Albania            Tirana
2    34  DZA         Algeria           Algiers
3   213  ASM  American Samoa         Pago Pago
4   203  AND         Andorra  Andorra la Vella

### Reading txt Files

In [4]:
# Using read_csv to read text files
# data_text = pd.read_csv(r"C:\Users\prajw\Downloads\Python Files\Jupyter File\countries of the world.txt", sep = "\t")
# data_text.head()

# Using read_table to read text files
data_text = pd.read_table(r"C:\Users\prajw\Downloads\Python Files\Jupyter File\countries of the world.txt")
data_text.head()

           Country                               Region
0     Afghanistan         ASIA (EX. NEAR EAST)
1         Albania   EASTERN EUROPE
2         Algeria   NORTHERN AFRICA
3  American Samoa   OCEANIA
4         Andorra   WESTERN EUROPE

### Reading JSON Files

In [5]:
data_json = pd.read_json(r"C:\Users\prajw\Downloads\Python Files\Jupyter File\json_sample.json")
data_json.head()

,12 Strong,A Fantastic Woman (Una Mujer Fantástica),All The Money In The World,Bilal: A New Breed Of Hero,Call Me By Your Name,Darkest Hour,Den Of Thieves,Ferdinand,Fifty Shades Freed,Film Stars Don'T Die In Liverpool,...,The 15:17 To Paris,The Commuter,The Disaster Artist,The Greatest Showman,The Insult (L'Insulte),The Post,The Shape Of Water,"Three Billboards Outside Ebbing, Missouri",Till The End Of The World,Winchester
0,"{'Genre': 'Action', 'Gross': '$453,173', 'IMDB...","{'popcornscore': 83, 'rating': 'R', 'tomatosco...","{'popcornscore': 71, 'rating': 'R', 'tomatosco...","{'popcornscore': 91, 'rating': 'PG13', 'tomato...","{'popcornscore': 87, 'rating': 'R', 'tomatosco...","{'popcornscore': 84, 'rating': 'PG13', 'tomato...","{'Genre': 'Action', 'Gross': '$491,898', 'IMDB...","{'popcornscore': 49, 'rating': 'PG', 'tomatosc...","{'Genre': 'Drama', 'Gross': 'unknown', 'IMDB M...","{'popcornscore': 69, 'rating': 'R', 'tomatosco...",...,"{'Genre': 'Drama', 'Gross': 'unknown', 'IMDB M...","{'popcornscore': 48, 'rating': 'PG13', 'tomato...","{'popcornscore': 89, 'rating': 'R', 'tomatosco...","{'Genre': 'Biography', 'Gross': '$627,248', 'I...","{'popcornscore': 86, 'rating': 'R', 'tomatosco...","{'Genre': 'Biography', 'Gross': '$463,228', 'I...","{'Genre': 'Adventure', 'Gross': '$448,287', 'I...","{'popcornscore': 87, 'rating': 'R', 'tomatosco...","{'popcornscore': -1, 'rating': 'NR', 'tomatosc...","{'Genre': 'Biography', 'Gross': '$696,786', 'I..."

### Using the info() function

In [6]:
data_xlsx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     234 non-null    int64
 1   CCA3     234 non-null    object
 2   Country  234 non-null    object
 3   Capital  234 non-null    object
dtypes: int64(1), object(3)
memory usage: 7.4+ KB

### Accessing specific columns of a DataFrame

In [7]:
data_xlsx[['Rank', 'CCA3']]

     Rank CCA3
0      36  AFG
1     138  ALB
2      34  DZA
3     213  ASM
4     203  AND
..    ...  ...
229   226  WLF
230   172  ESH
231    46  YEM
232    63  ZMB
233    74  ZWE

[234 rows x 2 columns]

### Usage of loc and iloc functions

In [8]:
data_xlsx.loc[224]

Rank               43
CCA3              UZB
Country    Uzbekistan
Capital      Tashkent
Name: 224, dtype: object

In [9]:
print(type(data_xlsx.loc[224]))

<class 'pandas.core.series.Series'>

In [10]:
data_xlsx.iloc[224]

Rank               43
CCA3              UZB
Country    Uzbekistan
Capital      Tashkent
Name: 224, dtype: object

In [11]:
print(type(data_xlsx.iloc[224]))

<class 'pandas.core.series.Series'>